In [3]:
import pandas as pd

In [4]:
# Use the pd.read_csv() method to load a dataframe
# We can load .csv files, but also .zip files which contain .csv files
# Load the file 'mini_cast.zip'
df = pd.read_csv('mini_cast.zip')

In [5]:
# Take a quick look at the first twenty entries of the dataframe
df.head(20)

,title,year,name,type,character,n
0,Demony wojny wedlug Goi,1998,Olaf Lubaszenko,actor,Lt. Czacki,6.0
1,Boone: The Bounty Hunter,2017,Osric Chau,actor,Denny,2.0
2,Lang ist es her...,1931,Renee May,actor,"Reserl, ihre Tochter",2.0
3,Miss Malini,1947,Javar Seetharaman,actor,Director of Kala Mandhiram,NaN
4,American Wrestler: The Wizard,2016,Daniel (XIII) Pacheco,actor,East Petaluma Wrestler,34.0
5,Bad boy dak gung,2000,Blackie Shou Liang Ko,actor,Dark Tung,8.0
6,Excuses!,2003,Mar Col√†s,actress,Ver√≤nica,6.0
7,Alan & Naomi,1992,Michael Gross,actor,Sol Silverman,3.0
8,10 jours en or,2012,Alain Buron,actor,Chef de rayon supermarch√©,18.0
9,Guest iin London,2017,Moe Bilal,actor,Funeral Ward Man,NaN
10,The Girls' Room,2000,Lela Lee,actress,Chloe,10.0
11,Yankee Doodle in Berlin,1919,Harry Gribbon,actor,German Guard,NaN
12,The Forbidden Note,2016,Paul (X) Johnston,actor,Benzarts Youth Gang,36.0
13,Buddy Solitaire,2016,Shawn Cahill,actor,Monk,NaN
14,Unhinged (V),2017,Julie (VII) Richardson,actress,Estelle,NaN
15,Crossroads,2014,Kari Nissena,actress,Laura,NaN
16,Small Town Saturday Night,2010,Perry Anzilotti,actor,Claude Cline,25.0
17,While London Sleeps,1926,Carl Stockdale,actor,Stokes,8.0
18,The Harvest Project,2008,Edan Armstrong,actor,Male cadaver,33.0
19,DisOrientation,2012,David (XLII) Scott,actor,Officer Kosar,NaN

In [6]:
### edTest(test_entries) ###
# The len() function can be used to see the number of rows in your dataframe
# find the number of rows in the original dataframe
entries = len(df)
print(entries)

172145

In [7]:
# .shape gives the total number of rows and columns
# Check the shape of the original dataframe
shape = df.shape
print(shape)

(172145, 6)

In [8]:
# Use .columns to see the columns in the dataframe
cols = df.columns
print(cols)

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [9]:
# You can change the columns to python native lists using .tolist() function on cols
col_list = df.columns.tolist()

In [10]:
# Change the final column name from 'n' to 'role_importance'
col_list[-1] = 'role_importance'
print(col_list)

['title', 'year', 'name', 'type', 'character', 'role_importance']

In [11]:
# You can cast the new col_list to the dataframe by setting the df.columns = col_list
df.columns = col_list
df.head()

,title,year,name,type,character,role_importance
0,Demony wojny wedlug Goi,1998,Olaf Lubaszenko,actor,Lt. Czacki,6.0
1,Boone: The Bounty Hunter,2017,Osric Chau,actor,Denny,2.0
2,Lang ist es her...,1931,Renee May,actor,"Reserl, ihre Tochter",2.0
3,Miss Malini,1947,Javar Seetharaman,actor,Director of Kala Mandhiram,NaN
4,American Wrestler: The Wizard,2016,Daniel (XIII) Pacheco,actor,East Petaluma Wrestler,34.0

In [12]:
### edTest(test_cols) ###
# We can subselect particular columns by choosing a sublist
few_cols = ['title','year','name']
df[few_cols]

                                    title  year                   name
0                 Demony wojny wedlug Goi  1998        Olaf Lubaszenko
1                Boone: The Bounty Hunter  2017             Osric Chau
2                      Lang ist es her...  1931              Renee May
3                             Miss Malini  1947      Javar Seetharaman
4           American Wrestler: The Wizard  2016  Daniel (XIII) Pacheco
...                                   ...   ...                    ...
172140                     The Tournament  2005               John Los
172141      On Air: Storia di un Successo  2016              Luca Alba
172142                                  R  2010          Bushra Sadaio
172143  Una storia moderna - L'ape regina  1963          Walter Giller
172144          Le crocodile du Botswanga  2014  Franck de la Personne

[172145 rows x 3 columns]

## ‚è∏ `df[['x']]` vs `df['x']`

What is the difference between the two operations above for a valid dataframe with a column named 'x'.

#### A. `df[['x']]` returns a `pd.DataFrame` object  whereas `df['x']` returns a `pd.Series` object
#### B. `df[['x']]` returns a `pd.Series` object  whereas `df['x']` returns a `pd.DataFrame` object
#### C. `df[['x']]` is an invalid operation
#### D. `df['x']` is an invalid operation

In [13]:
### edTest(test_chow1) ###

# Submit an answer choice as a string below (eg. if you choose option C, put 'C')
answer1 = 'A'

### üôãüèª How many roles are undefined ?

In [14]:
# First get the series corresponding to the 'role_importance' column
role_series = df['role_importance' ]
role_series

0          6.0
1          2.0
2          2.0
3          NaN
4         34.0
          ...
172140     NaN
172141     4.0
172142    25.0
172143     3.0
172144     5.0
Name: role_importance, Length: 172145, dtype: float64

In [15]:
# Select only the non-NaN values by using .notna() method on 'role_series'
boolean_series = role_series.notna()

In [16]:
# Index the original dataframe with the 'boolean' mask and find the length
num_of_notna_roles = len(df[boolean_series])
print(num_of_notna_roles)

105653

## Part 2: Series operations

In [17]:
# Let's call another dataset 'titles.zip'
# which has a lot more movies but fewer columns
titles = pd.read_csv('titles.zip')

# Take a quick look at the dataset
titles.head()

                       title  year
0       The Hell with Heroes  1968
1  Raptola, violola y matola  1989
2       Kigeki: Otto urimasu  1968
3                 Tanga-Tika  1953
4        Burning an Illusion  1981

In [18]:
# Get a series of the year in which the movies were released
year = titles['year']
print(year)

0         1968
1         1989
2         1968
3         1953
4         1981
          ...
226008    1985
226009    1963
226010    1967
226011    1993
226012    1957
Name: year, Length: 226013, dtype: int64

In [19]:
# Create a boolean series with only the years > 2000
boolean_series = titles['year']>2000

In [20]:
### edTest(test_counts) ###
# Use the .value_counts() method on `boolean_series` to see how many films were released before and after 2000
counts = boolean_series.value_counts()

# Take the count of the 'True' booleans 
movies_after_2000 = counts[True]
print(f'Number of movies released after the year 2000 are {movies_after_2000}')

Number of movies released after the year 2000 are 99253

In [21]:
# We can even filter the dataframe with the boolean series directly
# with the syntax titles[boolean_series]
titles_post_2000 = titles[boolean_series]
titles_post_2000.head()

                             title  year
5           Swades: We, the People  2004
9                         Zutaboro  2015
10                         On_Line  2002
14  I'm Very Much in Love with You  2018
18                      Umut adasi  2006

### üôãüèª How many movies in the decade of 2000 ?

In [22]:
# To answer the above question, we can operate on the year 'Series' directly 
# get the series associated with the 'year' column, floor divide it by 10 and multiply by 10
# equate this with 2000 to get a boolean series of movies in the year 200x
boolean_series = (year // 10 * 10) == 2000

In [23]:
# Similarly, we can filter out a dataframe with only the movies in the decade of 2000
# using the same boolean_series mentioned above
titles_2k = titles[boolean_series]
titles_2k.head()

                     title  year
5   Swades: We, the People  2004
10                 On_Line  2002
18              Umut adasi  2006
27       Valerie's Orchard  2007
28             Mo Suna Pua  2007

## Indexing/Slicing Rows of DataFrames
- Simple ways of selecting all rows and columns (`df[:]`)
- Rows can be accessed via a key or an integer corresponding to the row number. 
- Omitting a value generally means *all values* before or after an item.
- When we retrieve single or mulitiple rows, the result is a Dataframe.
- We can do this in several ways, either directly, with `loc` or with `iloc`.

In [24]:
# We can use the boolean series along with loc as well
# with syntax titles.loc[boolean_series]
titles_2k = titles.loc[boolean_series]
titles_2k.head()

                     title  year
5   Swades: We, the People  2004
10                 On_Line  2002
18              Umut adasi  2006
27       Valerie's Orchard  2007
28             Mo Suna Pua  2007

In [25]:
# loc takes both rows and columns, so we can specify if we only want the title
# with syntax titles.loc[boolean_series,['title']]
only_titles = titles.loc[boolean_series, ['title']]
only_titles.head()

                     title
5   Swades: We, the People
10                 On_Line
18              Umut adasi
27       Valerie's Orchard
28             Mo Suna Pua

## ‚è∏ `.loc()` vs `.iloc()`
Suppose we have the `toy_df` dataframe below.
```python3
        name        role
1     Pavlos   Architect
2      Rahul  Instructor
3  Chaitanya          TA
4     Hemani          TA
5      Viraj          TA
6   Abjasree          TA
7   Karthiga          TA
```

Which operation will give you the following output:

```python3
name       Pavlos
role    Architect
Name: 1, dtype: object
```

#### A. `toy_df.iloc[0]`
#### B. `toy_df.loc[0]`
#### C. `toy_df.iloc[1]`
#### D. `toy_df.loc[1]`

In [26]:
toy_df = pd.DataFrame({'name':['Pavlos','Rahul','Chaitanya','Hemani','Viraj', 'Abjasree', 'Karthiga'],'role':['Architect','Instructor','TA','TA','TA','TA','TA']},index = [1,2,3,4,5,6,7])
toy_df.head()

        name        role
1     Pavlos   Architect
2      Rahul  Instructor
3  Chaitanya          TA
4     Hemani          TA
5      Viraj          TA

In [27]:
### edTest(test_chow2) ###
# There may be multiple right answers, therefore your answer should be a list, 
# for example ['a' , 'c' , 'd']
answer2 = ['a', 'd']